In [1]:
import numpy 
import pandas as pd

In [2]:
s = pd.read_csv('seat_no_name_monther_name.csv')

In [3]:
s.head()

   Unnamed: 0     seat_no                      name mother_name     PRN_NO
0           0  S150088539     AVHAD KALPESH BALIRAM  RANJANABAI  71842239C
1           1  S150088540  AWACHAR SHOBHANA BHAURAO   SUNITATAI  71842242C
2           2  S150088541      AWALE PRAJAKTA SUNIL       KUSUM  71842243M
3           3  S150088542   BHOSALE RUSHIKESH VIJAY     HIRABAI  71842298J
4           4  S150088543  BHOSALE VISHWAJEET VILAS      SUNITA  71842300D

In [12]:
d = pd.read_csv(r'C:\Users\Suraj\OneDrive\Desktop\Streamlit_web_app\final_mark_output.csv')

In [13]:
d[d['subject']=='207003']

,Unnamed: 0,subject,OE,TH,OE_TH,TW,PR,OR,TOT,CRD,GRD,PTS1,PTS2
0,0,214441,030/050,024/050,054/100,--,--,--,54,04,B,06,24
1,1,214442,036/050,031/050,067/100,--,--,--,67,04,A,08,32
2,2,214443,026/050,033/050,059/100,--,--,--,59,04,B+,07,28
3,3,214444,029/050,036/050,065/100,--,--,--,65,04,A,08,32
4,4,214445,040/050,032/050,072/100,--,--,--,72,04,A+,09,36

In [16]:
a = d.groupby('subject')

In [ ]:
p = pd.DataFrame({'subj'})

In [25]:
len(d[d['subject'] == '214441'])

127